B0weny-qwq/Mspm0G3507-ef-agent/linker/Platform/Inc/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the LP_MSPM0G3507
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_LP_MSPM0G3507
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define GPIO_HFXT_PORT                                                     GPIOA
#define GPIO_HFXIN_PIN                                             DL_GPIO_PIN_5
#define GPIO_HFXIN_IOMUX                                         (IOMUX_PINCM10)
#define GPIO_HFXOUT_PIN                                            DL_GPIO_PIN_6
#define GPIO_HFXOUT_IOMUX                                        (IOMUX_PINCM11)

#define CPUCLK_FREQ                                                     80000000


/* Defines for UART_DEBUG */
#define UART_DEBUG_INST                                                    UART0
#define UART_DEBUG_INST_FREQUENCY                                       40000000
#define UART_DEBUG_INST_IRQHandler                              UART0_IRQHandler
#define UART_DEBUG_INST_INT_IRQN                                  UART0_INT_IRQn
#define GPIO_UART_DEBUG_RX_PORT                                            GPIOA
#define GPIO_UART_DEBUG_TX_PORT                                            GPIOA
#define GPIO_UART_DEBUG_RX_PIN                                    DL_GPIO_PIN_11
#define GPIO_UART_DEBUG_TX_PIN                                    DL_GPIO_PIN_10
#define GPIO_UART_DEBUG_IOMUX_RX                                 (IOMUX_PINCM22)
#define GPIO_UART_DEBUG_IOMUX_TX                                 (IOMUX_PINCM21)
#define GPIO_UART_DEBUG_IOMUX_RX_FUNC                  IOMUX_PINCM22_PF_UART0_RX
#define GPIO_UART_DEBUG_IOMUX_TX_FUNC                  IOMUX_PINCM21_PF_UART0_TX
#define UART_DEBUG_BAUD_RATE                                            (115200)

/* Defines for SPI_BOARD */
#define SPI_BOARD_INST                                                      SPI1
#define SPI_BOARD_INST_IRQHandler                                SPI1_IRQHandler
#define SPI_BOARD_INST_INT_IRQN                                    SPI1_INT_IRQn
#define SPI_BOARD_INST_FREQUENCY                                      80000000U
#define SPI_BOARD_SCLK_HZ                                             40000000U
#define GPIO_SPI_BOARD_POCI_PORT                                           GPIOB
#define GPIO_SPI_BOARD_POCI_PIN                                    DL_GPIO_PIN_7
#define GPIO_SPI_BOARD_IOMUX_POCI                                (IOMUX_PINCM24)
#define GPIO_SPI_BOARD_IOMUX_POCI_FUNC                 IOMUX_PINCM24_PF_SPI1_POCI
#define GPIO_SPI_BOARD_PICO_PORT                                           GPIOB
#define GPIO_SPI_BOARD_PICO_PIN                                    DL_GPIO_PIN_8
#define GPIO_SPI_BOARD_IOMUX_PICO                                (IOMUX_PINCM25)
#define GPIO_SPI_BOARD_IOMUX_PICO_FUNC                 IOMUX_PINCM25_PF_SPI1_PICO
#define GPIO_SPI_BOARD_SCLK_PORT                                           GPIOB
#define GPIO_SPI_BOARD_SCLK_PIN                                    DL_GPIO_PIN_9
#define GPIO_SPI_BOARD_IOMUX_SCLK                                (IOMUX_PINCM26)
#define GPIO_SPI_BOARD_IOMUX_SCLK_FUNC                 IOMUX_PINCM26_PF_SPI1_SCLK

/* Port definition for Pin Group GPIO_BOARD_DEVICES */
#define GPIO_BOARD_DEVICES_PORT                                           (GPIOB)

/* W25Q128 chip-select: GPIOB.6 */
#define GPIO_BOARD_DEVICES_FLASH_CS_PIN                            DL_GPIO_PIN_6
#define GPIO_BOARD_DEVICES_FLASH_CS_IOMUX                         (IOMUX_PINCM23)

/* LCD control pins */
#define GPIO_BOARD_DEVICES_LCD_RES_PIN                            DL_GPIO_PIN_10
#define GPIO_BOARD_DEVICES_LCD_RES_IOMUX                         (IOMUX_PINCM27)
#define GPIO_BOARD_DEVICES_LCD_DC_PIN                             DL_GPIO_PIN_11
#define GPIO_BOARD_DEVICES_LCD_DC_IOMUX                          (IOMUX_PINCM28)
#define GPIO_BOARD_DEVICES_LCD_CS_PIN                             DL_GPIO_PIN_14
#define GPIO_BOARD_DEVICES_LCD_CS_IOMUX                          (IOMUX_PINCM31)
#define GPIO_BOARD_DEVICES_LCD_BLK_PIN                            DL_GPIO_PIN_26
#define GPIO_BOARD_DEVICES_LCD_BLK_IOMUX                         (IOMUX_PINCM57)

/* Port definition for Pin Group GPIO_BUTTONS */
#define GPIO_BUTTONS_PORT                                                (GPIOB)

/* Defines for BOOT: GPIOB.21 with pinCMx 49 on package pin 20 */
#define GPIO_BUTTONS_BOOT_PIN                                   (DL_GPIO_PIN_21)
#define GPIO_BUTTONS_BOOT_IOMUX                                  (IOMUX_PINCM49)
#define GPIO_BUTTONS_BOOT_IOMUX_FUNC               IOMUX_PINCM49_PF_GPIOB_DIO21



/* Port definition for Pin Group GPIO_LEDS */
#define GPIO_LEDS_PORT                                                   (GPIOB)

/* Defines for USER_LED_1: GPIOB.22 with pinCMx 50 on package pin 21 */
#define GPIO_LEDS_USER_LED_1_PIN                                (DL_GPIO_PIN_22)
#define GPIO_LEDS_USER_LED_1_IOMUX                               (IOMUX_PINCM50)
/* Defines for USER_LED_3: GPIOB.27 with pinCMx 58 on package pin 29 */
#define GPIO_LEDS_USER_LED_3_PIN                                (DL_GPIO_PIN_27)
#define GPIO_LEDS_USER_LED_3_IOMUX                               (IOMUX_PINCM58)
/* Defines for USER_TEST: GPIOB.16 with pinCMx 33 on package pin 4 */
#define GPIO_LEDS_USER_TEST_PIN                                 (DL_GPIO_PIN_16)
#define GPIO_LEDS_USER_TEST_IOMUX                                (IOMUX_PINCM33)


/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_UART_DEBUG_init(void);
void SYSCFG_DL_SPI_BOARD_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
